# Python Intro - Final Exercise

In [1]:
import pyodbc
import pandas as pd
import numpy as np

In [2]:
### In windows, Using a ODBC DNS (predefined connection name)
import pyodbc
conn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                      "Server=DESKTOP-N6AVJGE\SQLEXPRESS;"
                      "Database=COLLEGE;"
                      "Trusted_Connection=yes;")

In [3]:
### Get the students table
import pandas as pd
students = pd.read_sql("SELECT * FROM Students;",conn)
students.head()

   StudentId FirstName   LastName Gender
0      162.0    Elmira    Holston      F
1      154.0    Sierra  Van Vorst      F
2       28.0     Mycah    Bingham      F
3       54.0      Alia      Jones      F
4       31.0    Chanda   Fillmore      F

In [5]:
### Get the Courses table
courses = pd.read_sql("SELECT * FROM Courses;",conn)
courses.head()

   CourseId            CourseName  DepartmentID  TeacherId
0       1.0     English Begginers           1.0       15.0
1       2.0      Advanced English           1.0       15.0
2       3.0  Proffesional English           1.0       15.0
3       4.0       Mathematics 101           2.0        2.0
4       5.0   Matematics Advanced           2.0       13.0

In [6]:
### Get the Classrooms table
classrooms = pd.read_sql("SELECT * FROM Classrooms;",conn)
classrooms.head()

   CourseId  StudentId     degree
0       1.0      202.0  92.031070
1       1.0       12.0  81.175916
2       1.0      232.0  82.396587
3       1.0      123.0  62.420449
4       1.0      274.0  72.569900

In [7]:
### Get the Departments table
departments = pd.read_sql("SELECT * FROM Departments;",conn)
departments.head()

   DepartmentId DepartmentName
0           1.0        English
1           2.0        Science
2           3.0           Arts
3           4.0          Sport

# Questions
 
 
## Q1. Count the number of students on each department

In [8]:
###inner merge courses and classrooms by CoureId
numstud=pd.merge(courses,classrooms,on='CourseId')

numstud.head(80)

,CourseId,CourseName,DepartmentID,TeacherId,StudentId,degree
0,1.0,English Begginers,1.0,15.0,202.0,92.031070
1,1.0,English Begginers,1.0,15.0,12.0,81.175916
2,1.0,English Begginers,1.0,15.0,232.0,82.396587
3,1.0,English Begginers,1.0,15.0,123.0,62.420449
4,1.0,English Begginers,1.0,15.0,274.0,72.569900
...,...,...,...,...,...,...
75,3.0,Proffesional English,1.0,15.0,26.0,82.740856
76,3.0,Proffesional English,1.0,15.0,146.0,84.785099
77,3.0,Proffesional English,1.0,15.0,28.0,85.842696
78,3.0,Proffesional English,1.0,15.0,109.0,81.613981
79,3.0,Proffesional English,1.0,15.0,263.0,76.478726

In [9]:
###count distinct the number of students, groupby deprtmentID. merge with deprtments to get the Department names. 
###since the column name is different, we need to assign the column name for each merging side.
pd.merge((numstud.groupby('DepartmentID').agg({'StudentId': pd.Series.nunique}))
         ,departments,left_on='DepartmentID',right_on='DepartmentId')

   StudentId  DepartmentId DepartmentName
0       84.0           1.0        English
1      200.0           2.0        Science
2      137.0           3.0           Arts
3       81.0           4.0          Sport

In [10]:
###count distinct the number of students, groupby deprtmentID. merge with deprtments to get the Department names. 
###since the column name is different, we need to assign the column name for each merging side.
pd.merge((numstud.groupby('DepartmentID').agg({'StudentId': 'nunique'}))
         ,departments,left_on='DepartmentID',right_on='DepartmentId')

   StudentId  DepartmentId DepartmentName
0         84           1.0        English
1        200           2.0        Science
2        137           3.0           Arts
3         81           4.0          Sport

In [11]:
###inner merge courses and classrooms on CourseId, merge with deprtments and 
### aggregation of the number of students, groupby deprtmentID, to get the Department names. 
###since the column name written differently, we need to refer to each column at each merging side.
pd.merge((pd.merge(courses,classrooms,on='CourseId')        
          .groupby('DepartmentID').agg({'StudentId': pd.Series.nunique}))
         ,departments,left_on='DepartmentID',right_on='DepartmentId')

   StudentId  DepartmentId DepartmentName
0       84.0           1.0        English
1      200.0           2.0        Science
2      137.0           3.0           Arts
3       81.0           4.0          Sport

## Q2. How many students have each course of the English department and the total number of students in the department?

In [61]:

dep_class_stud=pd.merge((numstud.groupby('DepartmentID').agg({'StudentId': 'nunique'}))
         ,departments,left_on='DepartmentID',right_on='DepartmentId')
dep_class_stud

   StudentId  DepartmentId DepartmentName
0         84           1.0        English
1        200           2.0        Science
2        137           3.0           Arts
3         81           4.0          Sport

In [12]:
if numstud[numstud.DepartmentID==1]

,CourseId,CourseName,DepartmentID,TeacherId,StudentId,degree
0,1.0,English Begginers,1.0,15.0,202.0,92.031070
1,1.0,English Begginers,1.0,15.0,12.0,81.175916
2,1.0,English Begginers,1.0,15.0,232.0,82.396587
3,1.0,English Begginers,1.0,15.0,123.0,62.420449
4,1.0,English Begginers,1.0,15.0,274.0,72.569900
...,...,...,...,...,...,...
89,3.0,Proffesional English,1.0,15.0,42.0,72.225629
90,3.0,Proffesional English,1.0,15.0,189.0,74.163528
91,3.0,Proffesional English,1.0,15.0,132.0,78.775152
92,3.0,Proffesional English,1.0,15.0,100.0,76.162360
93,3.0,Proffesional English,1.0,15.0,149.0,73.691636

## Q3. How many small (<22 students) and large (22+ students) classrooms are needed for the Science department?

## Q4. A feminist student claims that there are more male than female in the College. Justify if the argument is correct

## Q5. For which courses the percentage of male/female students is over 70%?

## Q6. For each department, how many students passed with a grades over 80?

## Q7. For each department, how many students passed with a grades under 60?

## Q8. Rate the teachers by their average student's grades (in descending order).

## Q9. Create a dataframe showing the courses, departments they are associated with, the teacher in each course, and the number of students enrolled in the course (for each course, department and teacher show the names).

## Q10. Create a dataframe showing the students, the number of courses they take, the average of the grades per class, and their overall average (for each student show the student name).